/*Функція pow(x, n) (Задача)
важливість: 4
Напишіть функцію pow(x, n), яка повертає число x, піднесене до степеня n. 
Інакше кажучи, множить число x саме на себе n разів і повертає результат.

pow(3, 2) = 3 * 3 = 9
pow(3, 3) = 3 * 3 * 3 = 27
pow(1, 100) = 1 * 1 * ...* 1 = 1
Створіть сторінку, яка запитує x та n, а потім 
показує результат pow(x, n).

P.S. В цій задачі функція повинна підтримувати лише натуральні 
значення n, тобто цілі числа, починаючи з 1.
*/

/* - - - Моя відповідь - - - */
function pow (x, n) {
    let result = x 
        for (let a = 1; a < n; a++) {
    result *= x
    } 
return result
}
let x = prompt ('x', '');
let n = prompt ('n', '');
if (n < 1) {
    alert (`Степінь ${n} не підтримується, онлі натуральні числа`)
} else {
    alert (pow (x, n))
}
