/*Яке значення виведе цикл "while"? (Задача)
важливість: 4
Запишіть для кожного циклу значення, які він виведе. Потім порівняйте з відповіддю.

Чи виводять обидва цикли однакові значення?

1.
Префіксна форма ++i:

let i = 0;
while (++i < 5) alert( i );

2. 
Постфіксна форма i++
let i = 0;
while (i++ < 5) alert( i );

/* - - - Моя відповідь - - -
В обох циклах в нас присутній інкремент, відповідно задане значення в змінній буде добавлятись на одиницю.
Різниця префіксної та постфіксної форми полягає в тому, що коли саме добавляється ця одиниця:
1) Префіксний інкремент відбувається -ПЕРЕД- використанням значення змінної у виразі;
2) Постфіксний інкремент відбувається -ПІСЛЯ- використання значення змінної у виразі.
В циклі з використанням префіксної форми ++і кінцевим значенням буде 4. 
В циклі з використанням постфіксної форми і++ кінцевим значенням буде 5.

Іншими словами:
1. Префіксна форма ++і
Цикл виведе 1, 2, 3, 4;
2. Постфіксна форма і++
Цикл виведе 1, 2, 3, 4, 5.

Тому цикли НЕ виводять однакові значення.
*/

