/*Вивести прості числа (Задача)
важливість: 3
Просте число – це натуральне число, яке має два дільники (1 і саме число).

Інакше кажучи, n > 1 – просте, якщо воно більше за 1 і ділиться без остачі на 1 та n.

Наприклад, число 5 – просте, тому що воно не ділиться без остачі на 2, 3 і 4. Воно ділиться без остачі лише на 1 і на 5.

Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.

Для n = 10 результат повинен бути 2,3,5,7.

P.S. Код також повинен легко модифікуватися для будь-якого числа n.*/

/* - - - Моя відповідь - - - */
let n = 10

mark:
for (let a = 2; a <= n; a++) {
    for (let b = 2; b < a; b++) {
        if (a % b == 0) continue mark;
    }
    alert (a);
}
// Признаюсь, тут я підглянув рішення перш ніж виконувати самотужки
// я ніяк не міг доперти як цю задачу виконати...