/*Останнє значення циклу (Задача)
важливість: 3
Яке останнє значення буде виведено на екран? Чому?

let i = 3;

while (i) {
  alert( i-- );
}*/

/* - - - Моя відповідь - - -
З коду вище останнім значенням буде 1. 
Ми маємо змінну let і = 3
Дальше сам цикл while (i)
  alert (i--).
Відповідно що тут відбувається. Сам цикл while перевіряє кожну ітерацію і видає алерт, 
але в алерті використовується постфіксний декремент. Оскільки змінна i = 3, то цикл кожен раз
буде зменшувати трійку на одиницю і коли цикл дойде того, що і буде рівне нулю, це призведе до зупинення виконання
коду. Оскільки значення i в кінці буде дорівнювати 0 то умова while стає false. 
*/