/*Повторяти цикл, доки ввід невірний (Задача)
важливість: 5
Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.

Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.

Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення нечислового введення.*/

/* - - - Моя відповідь - - - */

let num;
do {
    num = prompt ('Введіть число', 0);
    if (num === null) {
        alert ('Ну введи число, тобі важко?')}
    else if (isNaN(num)) {
        alert ('Потрібно ввести число, а не букви писати...')}
    } while (num <= 100 && num || num === null || isNaN(num))
