/*Яке значення виведе цикл "for"? (Задача)
важливість: 4
Для кожного циклу запишіть, які значення він виведе. Потім порівняйте з відповіддю.

Обидва цикли виведуть одинакові числа чи ні?

1.
Постфіксна форма:
for (let i = 0; i < 5; i++) alert( i );

2.
Префіксна форма:

for (let i = 0; i < 5; ++i) alert( i );*/

/* - - - Моя відповідь - - - 
1. При використанні постфіксної форми в циклі значення будуть наступні:
0, 1, 2, 3, 4.
2. При використанні префіксної форми в циклі значення будуть наступні:
0, 1, 2, 3, 4.

Обидва цикли виведуть однакові числа.
*/

